---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewAssociatedAssemblyInstanceId
source: html/9af2c0b6-676e-0d81-3493-29e4427d28ac.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewAssociatedAssemblyInstanceId Property

"Associated Assembly Instance"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewAssociatedAssemblyInstanceId { get; }
```